BusinessProcesses/ТестированиеКандидата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<BusinessProcess>
		<Properties>
			<Name>ТестированиеКандидата</Name>
			<Task>Task.ЗадачаТестированияКандидата</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПройденТестАдмиминстрирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПройденТестПрограммирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредложеннаяВакансия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/Вакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>Вакансии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оператор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Программист</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/ТестированиеКандидата/Ext/ObjectModule.bsl
Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
    
    
    Результат = ПройденТестАдмиминстрирование;
    
КонецПроцедуры

Процедура Условие2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) 
    
       Результат = ПройденТестПрограммирование;

КонецПроцедуры

Процедура Действие1ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
    ПредложеннаяВакансия = Перечисления.Вакансии.Оператор;
КонецПроцедуры

Процедура Действие2ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
   ПредложеннаяВакансия = Перечисления.Вакансии.Администратор;
КонецПроцедуры

Процедура Действие3ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
     ПредложеннаяВакансия = Перечисления.Вакансии.Программист;
КонецПроцедуры
